2+5

10-4

6*3

18/9

2*5-3

7/5*6

7%/%5*6

7%%5*6

7%%3

7%/%3

15/4

15%/%4

15%%4

##algoritmo de Euclides
### cuantos días son 379 horas

379/24

379%/%24

379%%24

##15 días y 19 horas

##mcd (máximo comun divisor) entre 379 y 24

#379 = 24 * 15 + 19

24*15+19


24%/%19
24%%19

#24 = 19 * 1 + 5

19 * 1 + 5

19%/%5
19%%5

#19 = 5 * 3 + 4

5 * 3 + 4


5%/%4
5%%4

#5 = 4 * 1 + 1

4 * 1 + 1

4%/%1
4%%1

# 4 = 4 * 1 + 0

## el mcd entre 379 y 24 es 1


##379 es igual a divisor por cociente más resto

#D = d * q + r
#379 = 24 * 15 + 19

24*15+19

# r = D - d * q
# 19 = 379-24*15

379-24*15

#q = D%/%d
#15 = 379%/%24

379%/%24











